<html>
  <body>
    <h1>Willkommen zu Kontact Touch!</h1>
    <p>Dieses Dokument dient dazu, Ihnen mit ein paar Tipps den Einstieg in die Benutzung der Kontact Touch Applikationen (Mail, Adressen, Termine, Aufgaben und Notizen) zu vereinfachen. Weiterf&uuml;hrende Informationen stehen Ihnen jederzeit im Internet zur Verf&uuml;gung (s.u.).</p>
    <h2>Benutzung von Kontact Touch</h2>
    <h3>Navigation</h3>
    <p>Auf der linken Seite finden Sie die Navigationsleiste. Hier k&ouml;nnen Sie durch Antippen der Ordnernamen durch Ihre Ordner navigieren. Der aktuell ausgew&auml;hlte Ordner ist nach oben und unten von den anderen Ordnern abgegrenzt.</p>
    <h3>Aktionen</h3>
    <p>Ganz auf der linken Seite finden Sie in der Regel eine oder mehrere so genannte "Laschen". Darunter findet sich in der Regel eine mit der Aufschrift "Aktionen". Diese Laschen k&ouml;nnen Sie herausziehen indem Sie von links nach rechts dar&uuml;ber streichen. So wird verhindert, dass Sie aus Versehen den Ordner wechseln, obwohl Sie eigentlich eine Aktion ausf&uuml;hren wollten.</p>
    <p>Das so ge&ouml;ffnete Aktionsmen&uuml; bietet Ihnen immer eine Auswahl von Aktionen an, die sich je nach Ansicht &auml;ndern. So k&ouml;nnen Sie im Aktionsmen&uuml; der "Home"-Ansicht grundlegende Konfigurationen vornehmen, wie ein neues Account hinzuf&uuml;gen. &Ouml;ffnen Sie das Men&uuml; aus einer Ansicht in der beispielsweise mehrere Mails dargestellt werden, so finden Sie im Aktionsmenu M&ouml;glichkeiten, mit diesen Mails zu arbeiten (etwa verschieben, l&ouml;schen oder darauf zu antworten).</p>
    <h3>Auswahl einzelner Objekte</h3>
    <p>M&ouml;chten Sie einzelne Objekte (z.B. eine Mail) ausw&auml;hlen, um diese zu lesen, so tippen Sie einfach in der Liste auf dieses Objekt. Es wird dann ge&ouml;ffnet. In dieser Ansicht k&ouml;nnen Sie durch Streichen nach oben oder unten die nicht sichtbare Teile des Objekts erreichen ("Scrollen"). Streichen Sie nach rechts oder links, so bl&auml;ttern Sie durch die Liste der Objekte - es wird also das n&auml;chste oder vorhergehende Objekt der Liste geladen. Zus&auml;tzlich finden Sie im rechten unteren Bereich des Objekts ein oder mehrere Icons. Eines davon symbolisiert eine Liste und bringt Sie aus der Ansicht eines Objekts zur&uuml;ck in den Navigationsmodus.</p>
    <h3>Erste Schritte</h3>
    <p>Legen Sie als erstes im "Aktionen"-Menu der "Home"-Ansicht unter dem Punkt "Konten" Ihre vorhanden E-Mail und Groupware Konten an. Bitte beachten Sie, dass die nachfolgende erste Synchronisation sehr lange dauern kann. Ist diese einmalig erfolgt, sollte Kontact Touch fl&uuml;ssig laufen.</p>
    <h2>Tipps und Tricks</h2>
    <h3>Auswahl mehrerer Ordner</h3>
    <p>In der "Home"-Ansicht finden Sie unten rechts einen Button mit der Aufschrift "Ausw&auml;hlen". Tippen Sie darauf, so haben Sie die M&ouml;glichkeit, mehrere Ordner gleichzeitig auszuw&auml;hlen und nach tippen auf "Fertig" anzeigen zu lassen. Zur Auswahl der Ordner k&ouml;nnen Sie wie gewohnt auf der linken Seite durch Ihre Ordner navigieren und die gew&uuml;nschten Ordner dann auf die rechte Seite ziehen.</p>
    <h3>H&auml;ufig ben&ouml;tigte Ansichten</h3>
    <p>Gibt es eine Ansicht mit einem oder mehreren Ordnern, die Sie besonders h&auml;ufig ben&ouml;tigen, so finden Sie im Aktionsmen&uuml; den Punkt "Als Favorit hinzuf&uuml;gen". W&auml;hlen Sie diesen aus, so k&ouml;nnen Sie einen Namen festlegen unter dem Sie diese Ansicht direkt aus der "Home"-Ansicht heraus anw&auml;hlen k&ouml;nnen. So k&ouml;nnen Sie schnell in alle h&auml;ufig ben&ouml;tigten Ansichten wechseln.</p>
    <h3>Bearbeiten vieler Objekte</h3>
    <p>M&ouml;chten Sie die gleiche Aktion mit vielen Objekten in einer Ansicht gleichzeitig machen (z.B. mehrere Mails in einen bestimmten Ordner verschieben), so k&ouml;nnen Sie in der Navigation auf den bereits ausgew&auml;hlten Ordner nochmals antippen. Die Ansicht wechselt daraufhin in den "Massenbearbeitungsmodus". Tippen Sie nun auf ein Objekt, so wird dieses lediglich ausgew&auml;hlt. Sie haben nun auf der linken Seite die M&ouml;glichkeit, bestimmte Aktionen mit den ausgew&auml;hlten Objekten durchzuf&uuml;hren (z.B. Verschieben). Sie k&ouml;nnen diesen "Massenbearbeitungsmodus" wieder verlassen, indem Sie auf den nach links weisenden Pfeil unterhalb des Ordnernamens tippen.</p>
    <h2>Weitere Informationen</h2>
    <p>Es gibt zahlreiche weitere Informations- und Hilfequellen f&uuml;r Sie. Diese finden Sie im Internet unter: <a href="http://userbase.kde.org/Kontact_Touch">http://userbase.kde.org/Kontact_Touch</a></p>
    <p>Das Entwicklungsteam w&uuml;nscht Ihnen viel Spa&szlig; mit Kontact Touch. Wir hoffen, dass Ihnen das Produkt gef&auml;llt und freuen uns &uuml;ber Ihr Feedback!</p>
  </body>
</html>
