<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [en] (X11; I; Linux 2.0.32 i486) [Netscape]">
   <TITLE>Using KPilot v1.1b</TITLE>
</HEAD>
<BODY>
<A NAME="using"></A>
<H2>
KPilot v1.1b benutzen</H2>
Wenn&nbsp; KPilot&nbsp; das erste Mal l&auml;uft, wird der Settings Dialog
angezeigt. Das Default Device (Die Schnittstelle, an der die Docking Station
h&auml;ngt) ist&nbsp; /dev/pilot. Lege einen Link von Deiner Hardwareschnittstelle
auf /dev/pilot. Du kannst jetzt die anderen Einstellungen vornehmen. Allerdings
ist es auch m&ouml;glich, dies zu einem sp&auml;teren Zeitpunkt zu machen.
Bitte beachte die Einstellung <B>"Local overrides pilot"</B>. Solltest
Du sowohl Ver&auml;nderungen an den Pilot Daten auf dem PC als auch auf
Deinem Pilot vorgenommen haben, wird durch diese Einstellung Dein Pilot
mit den Pilot Daten auf Deinem PC &uuml;berschrieben. <B><U>Dadurch k&ouml;nnen
Daten verloren gehen!</U></B> Normalerweise werden die Daten auf dem PC
durch die Daten des Pilot &uuml;berschrieben.
<BR>Klicke jetzt "OK" an, um zum KPilot Hauptmenue zu kommen.

<P>Es empfiehlt sich dringend, zu diesem Zeitpunkt ein Komplett Backup
Deines Pilot zu machen. Ein Komplett Backup kannst Du starten, wenn Du
im File Menue "Backup" ausw&auml;hlst.
<BR><A NAME="settings"></A>
<H2>
Die Konfiguration von KPilot</H2>

<H3>
Grundeinstellungen</H3>
Der Dialog f&uuml;r die Grundeinstellungen ist &uuml;ber das File Menue
erreichbar . Hier hast Du nochmal die M&ouml;glichkeit, die Schnittstelle
zur Docking Station einzustellen. Standardm&auml;&szlig;ig steht diese
auf <TT>/dev/pilot. </TT>Das ist ein Link auf die Schnittstelle, an der
Du die Dockingstation angeschlossen hast. <B>Pilot User</B> ist Dein User
Name.

<P><B>Sync Mail</B> bezieht sich auf die &Uuml;berpr&uuml;fung auf eingegangene
Mails bei Deinem lokalen POP server und das Versenden von Mail beim n&auml;chsten
HotSync.

<P><B>Sync Files</B> bezieht sich auf die Installation von neuen Programmen
und Dateien auf Deinem Pilot mit dem <A HREF="/usr/src/kpilot-1.1b/kpilot/doc/en/using-kpilot.html#installer">file
install utility</A> beim n&auml;chsten HotSync.

<P><B>Local overrides Pilot</B> Hier kannst Du einstellen, welche Daten
beim n&auml;chsten HotSync Priorit&auml;t haben, die des Pilot oder die
auf Deinem PC.
<BR>&nbsp;
<H3>
Einstellungen f&uuml;r Email</H3>
<B>Email Address</B> ist Deine email Adresse.

<P><B>Signature</B> ist der Text, der als Signatur ans Ende Deiner ausgehenden
Emails angeh&auml;ngt wird. Zur Zeit k&ouml;nnen noch keine Files angegeben
werden.

<P><B>Sendmail Cmd</B> ist das Kommando, das die Verarbeitung Deiner Mail
startet. Normalerweise kannst Du es bei der Voreinstellung belassen.

<P><B>The Pop settings</B> sind der Port Deines POP Servers und Dein Username
f&uuml;r den Zugriff auf diesen Server.

<P><B>Leave mail on server</B> bel&auml;&szlig;t alle Mail auf dem POP
Server. Das erm&ouml;glicht Dir die Verarbeitung der eingegangenen Mail
mit einem anderen Mailprogramm zu einem sp&auml;teren Zeitpunkt.

<P><B>Sync incoming and outgoing mail</B> Hier kannst Du entscheiden, ob
die Mail des POP Servers und Deines Pilots syncronisiert werden soll oder
nicht.
<H3>
Einstellungen der Adress Synchronisation</H3>
<B>Import and Export Format</B> Hier kannst Du die Im- und Export Formate
f&uuml;r die Adressdatenbank festlegen. In der Einstellung der Formate
f&uuml;r die Feldbegrenzungen d&uuml;rfen keine Leerzeichen auftauchen.
Zur Trennung der Felder kannst Du beispielsweise ein Komma verwenden.

<P><B>Use Key Field</B> weist KPilot an, das erste Feld als Schl&uuml;sselfeld
f&uuml;r die Adresssuche zu verwenden. Wenn Du Adressen in Kpilot importierst
und <B>Use Key Field</B> angew&auml;hlt wurde, wird diese Adresse bei einer
&Uuml;bereinstimmung der Felder aktualisiert. Wurde <B>Use Key Field</B>&nbsp;
nicht angew&auml;hlt, wird statt dessen eine neue Adresse f&uuml;r jeden
Eintrag in der Importdatei angelegt.&nbsp; <I>Bitte beachte, da&szlig;
das erste Feld im Importdatei das Schl&uuml;sselfeld ist!</I>
<H2>
Das Memo Utility</H2>
Der Memo Betrachter erlaubt Dir das Betrachten der Memos auf Deinem Pilot
sowie deren Export in Text Dateien oder auch den Import neuer Memos beim
n&auml;chsten HotSync. Zur Zeit ist das Bearbeiten von Memos noch nicht
m&ouml;glich. (Es ist jedoch m&ouml;glich, ein exportiertes Memo zu bearbeiten
und es wieder in den Pilot zu importieren. Auf dem Pilot hast Du dann sowohl
das Original Memo als auch die bearbeitete Version)
<H2>
Das Adress Utility</H2>
Der Adressbetrachter erlaubt Dir das Betrachten der Adressen auf Deinem
Pilot,deren Export sowie den Import neuer Adressen von und zu Deinem Pilot.
Das Format f&uuml;r den Im- und Export ist &uuml;ber den <A HREF="/usr/src/kpilot-1.1b/kpilot/doc/en/using-kpilot.html#settings">settings
dialog</A>. konfigurierbar. Beachte bitte, da&szlig; das erste Feld in
der Import Datei als Schl&uuml;sselfeld verwendet wird. Wenn Du <B>Use
Key Field</B> angew&auml;hlt hast, wird bei einer &Uuml;bereinstimmung
des Schl&uuml;sselfeldes der Datensatz aktualisiert. Falls keine &Uuml;bereinstimmung
im Schl&uuml;sselfeld gefunden wird, wird auf Deinem Pilot statt dessen
ein neuer Datensatz angelegt. Standardm&auml;&szlig;ig ist die Benutzung
des Schl&uuml;sselfeldes abgeschaltet, so da&szlig; f&uuml;r jede importierte
Adresse ein neuer Dateinsatz auf dem Pilot angelegt wird.
<BR><A NAME="installer"></A>
<H2>
Der File Installer</H2>
Der File Installer erm&ouml;glicht die &Uuml;bertragung von Dateien auf
Deinen Pilot. Dabei nutzt der File Installer die Drag and Drop F&auml;higkeiten
der KDE Oberfl&auml;che, genauer gesagtdes KFM. &Ouml;ffne dazu einfach
den Ordner, in dem die zur &Uuml;bertragung auf Deinen Pilot vorgesehenen
Dateien abgelegt sind und diehe sie mit der Maus auf das KPilot Fenster.
Alternativ dazu kannst Du auch den Add Button dr&uuml;cken und &uuml;ber
den Datei Dialog die gew&uuml;nschte Datei ausw&auml;hlen. &Uuml;ber "Clear
List" l&auml;&szlig;t sich diese Auswahl wieder r&uuml;ckg&auml;ngig machen.
<I>Da eine interne Kopie der installierten Datei auf Deinem Rechner bleibt,
kannst Du auch URLs vom KFM Browser per Drag and Drop installieren!</I>
<BR>
<HR>
<ADDRESS>
<A HREF="mailto:pilone@slac.com">Dan Pilone</A></ADDRESS>
<I><FONT COLOR="#3366FF"><A HREF="mailto:thomas_trueten@cyberjunkie.com">Thomas
Trueten</A></FONT></I>&nbsp; (Deutsche &Uuml;bersetzung)

<P><!-- Created: Sun Jan 25 03:54:45 EST 1998 --><!-- hhmts start -->Last
modified: Sun Jan 25 04:23:29 EST 1998&nbsp;<!-- hhmts end -->
</BODY>
</HTML>
